
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Справочники._Задачи.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	_Задачи.Важность КАК Важность,
	|	_Задачи.ДатаИзменения КАК ДатаИзменения,
	|	_Задачи.Инициатор КАК Инициатор,
	|	_Задачи.Наименование КАК Наименование,
	|	_Задачи.ПодробноеОписание КАК ПодробноеОписание,
	|	_Задачи.Программист КАК Программист,
	|	_Задачи.Состояние КАК Состояние,
	|	_Задачи.Статус КАК Статус,
	|	_Задачи.Комментарии.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Пользователь КАК Пользователь,
	|		ТекстКомментария КАК ТекстКомментария,
	|		ДатаКомментария КАК ДатаКомментария
	|	) КАК Комментарии
	|ИЗ
	|	Справочник._Задачи КАК _Задачи
	|ГДЕ
	|	_Задачи.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		Шапка.Параметры.Заполнить(Выборка);
		
		ТабДок.Вывести(Шапка, Выборка.Уровень());
		ОбластьКомментарииШапка = Макет.ПолучитьОбласть( "КомментарииШапка" );
		ОбластьКомментарии = Макет.ПолучитьОбласть( "Комментарии" );
		ТабДок.Вывести(ОбластьКомментарииШапка);
		ВыборкаКомментарии = Выборка.Комментарии.Выбрать();
		Пока ВыборкаКомментарии.Следующий() Цикл
			ОбластьКомментарии.Параметры.Заполнить(ВыборкаКомментарии);
			ТабДок.Вывести(ОбластьКомментарии, ВыборкаКомментарии.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
